<?php

$events = [
    [
        'event' => '携わっている事業が大成功する。1000万円もらう。',
        'profit' => 1000
    ],
    [
        'event' => '携わっている事業が大失敗する。500万円はらう。',
        'profit' => -500
    ],
    [
        'event' => '投資をしたスタートアップが大成功する。500万円もらう。',
        'profit' => 500
    ],
    [
        'event' =>'投資をしたスタートアップが大失敗する。800万円はらう。',
        'profit' =>-800
    ],
    [
        'event' => '結婚する。知り合いからご祝儀400万円もらう。',
        'profit' => 400
    ],
    [
        'event' => '結婚する。婚約指輪を購入し、200万円はらう。',
        'profit' => -400
    ],
    [
        'event' => '副業のプログラミングで一攫千金、400万円もらう。',
        'profit' => 400
    ],
    [
        'event' =>'副業で行っている事業が失敗、600万円はらう。',
        'profit' => -600
    ],
    [
        'event' => 'SNSで有名人になる。書籍を出版し、1,000万円もらう。',
        'profit' => 1000
    ],
    [
        'event' => 'SNSで大炎上する。訴えられ損害賠償金500万円はらう。',
        'profit' => -500
    ],
    [
        'event' => 'eSports世界大会で優勝する。700万円もらう。',
        'profit' => 700
    ],
    [
        'event' => 'eSports大会に出場し不正が発覚する。400万円はらう。',
        'profit' => -400
    ],
    [
        'event' => 'ポーカーで大勝ちする。500万円もらう。',
        'profit' => 500
    ],
    [
        'event' => 'ポーカーで大負けする。400万円はらう。',
        'profit' => -400
    ],
    [
        'event' => '宝くじを購入し大当たりする。1000万円もらう。',
        'profit' => 1000
    ],
    [
        'event' => '宝くじが全て外れる。300万円はらう。',
        'profit' => -300
    ],
    [
        'event' => '転職に成功する。400万円もらう。',
        'profit' => 400
    ],
    [
        'event' => '転職に失敗する。400万円はらう。',
        'profit' => -400
    ],
    [
        'event' => '海外でスカウトされる。500万円もらう。',
        'profit' => 500
    ],
    [
        'event' => '海外で詐欺に遭う。700万円はらう。',
        'profit' => -700
    ]
];

